#include <reg52.h>
#define PINLV     	11059200UL			 		//使用11.0592M晶体
#define BAUD_9600   9600UL		     			//波特率定义为9600
/***************************************************
*								串口初始化子函数
*				T1工作在方式2，波特率9600，开串口中断
****************************************************/
void UART_INIT(void)				//串口初始化
{
//	EA=0; 					//暂时关闭中断
	TMOD=0x20;    	//定时器1工作在模式2，自动重装模式
	SCON=0x50;     //串口工作在模式1
	TH1=256-PINLV/(BAUD_9600*12*16);  //计算定时器重装值
	TL1=256-PINLV/(BAUD_9600*12*16);
	PCON|=0x80;    //串口波特率加倍
	TR1=1;        	//启动定时器1

}

/***************************************************
*								串口发送字节子函数
*				依次将数组HELLO[]中的元素发送给电脑
****************************************************/
void uart_send_byte(unsigned char i)
{
		SBUF = i;	//送入发送缓冲寄存器
		while(TI == 0);		//判断发送是否完成
		TI = 0;						//清除中断标志
}